import React, { useEffect } from 'react';
import { div, img, div, BackHandler } from 'react-native';

import SimpleHeader from '../../../Components/CustomHeader/SimpleHeader/SimpleHeader';
import Collapse from '../../../Components/Collapse/Collapse';
import { logo } from '../../../Components/Images/Images';
import language from '../../../Assets/i18n/i18n';
import Store from '../../../Store/Store';
import styles from './Styles';

function AboutUs(props) {

    useEffect(() => {
        const backHandler = BackHandler.addEventListener("hardwareBackPress", backAction);
        return () => backHandler.remove();
    }, []);

    const backAction = () => {
        Store.incrementTabBar();
        props.history.goBack();
        return true;
    }

    return (
        <div style={styles.container}>
            <SimpleHeader
                func={backAction}
                title={'درباره daddy check'}
            />
            <div style={styles.view_logo}>
                <img style={styles.view_logo_img} source={logo} />
            </div>
            <div style={styles.collapse}>
                <Collapse
                    title={'درباره اپلیکیشن daddy check'}
                    body={'بیش از 40 درصد علل ناباروری، علت مردانه دارد و در بسیاری از موارد علل ناباروری مردان، قابل پیشگیری و درمان است. از طرفی زمان طلایی باروری زوجین قابل برگشت نبوده پس تشخیص زود هنگام علت ناباروری بسیار مهم و ضروری می باشد. \n\n با توجه به اینکه با بالا رفتن سن ممکن است کیفیت اسپرم کاهش شدیدی داشته باشد. و آقایان بعلل مختلف گاهی حاضر به انجام آزمایش نمی شوند. برخی از مشکلات عدم انجام آزمایش عبارتست از: \n\n بسیاری از آقایان تمایلی برای مراجعه به پزشک  و انجام آزمایش در مراکز درمان ناباروری ندارند. \n\n بسیاری از آزمایشگاههای تشخیص طبی، دارای شرایط مناسب برای نمونه گیری نیستند. \n\n بسیاری از نتایج آزمایشها بعلت استرسهای وارده بر بیماران از دقت خوبی برخوردار نبوده. \n\n در بسیاری از شهرها و روستاها امکان تشخیص درست و ارجاع به پزشک متخصص مناسب وجود ندارد. \n\n  به همین علت کیت تشخیصی ددی چک جهت سهولت برای بررسی اولیه علل ناباروری طراحی شده است. این کیت به شما کمک می کند تا براحتی و به دور از استرس موجود در مراکز درمانی و صرف هزینه های بالا این آزمایش را در منزل خود انجام دهید. برای انجام این آزمایش تنها کافی است ابتدا کیت را بر اساس مدل تلفن همراه خود تهیه نموده و اپلیکیشن مربوطه را طبق راهنمای موجود در کیت بصورت رایگان بر روی تلفن همراه نصب کرده سپس نحوه کار با ددی چک را در قسمت مربوطه در اپلیکیشن بطور کامل مطالعه نمایید و براحتی و به دور از هر گونه استرس در هر زمانی که خواستید آزمایش را انجام داده و از شرایط باروری خود آگاه شوید. \n\n ددی چک  یک آزمایش شخصی  مبتنی بر گوشی هوشمند است که نه تنها تجزیه و تحلیل حرکتی و تعداد اسپرم را گزارش می دهد بلکه یک ویدیو زنده از اسپرم شما بهمراه تحلیل حرکتی و شمارشی را نشان می دهد. کار با ددی چک آسان است. می توانید انیمیشن های آموزشی را بصورت کامل در سایت و اپلیکیشن مشاهده نمایید. \n\n  لطفاً توجه داشته باشید ددی چک یک آزمون اسپرم خانگی مبتنی بر گوشی هوشمند است که یک ارزیابی کمی و کیفی از تعداد اسپرمها و تحرک آنها بر اساس استانداردهای سازمان بهداشت جهانی (WHO) را فراهم می کند. \n\n توجه داشته باشید این آزمایش جهت  معاینه اولیه اسپرم است و  ارزیابی جامعی از وضعیت باروری مردان را ارائه نمی دهد. برای ارزیابی حرفه ای باید به مراکز تخصصی آزمایشگاهی مجاز ناباروری، مراکز درمان ناباروری با هدایت یک پزشک متخصص اورولوژی و یا متخصص زنان مراجعه کرد که مراکز استاندارد در قسمت متخصصین و مراکز درمانی بر اساس نزدیکی به محل زندگی شما ارائه می شود و قابل جستجو می باشند.'}
                />
                <Collapse
                    title={'درباره کیت'}
                    body={'به منظور تهیه کیت ددی چک و شروع آنالیز باروری بایستی به  آدرس سایت \"https://etcco.ir\" مراجعه گردد. \n در صفحه اول سایت بر روی عبارت خرید ددی چک کلیک کرده و براساس مدل تلفن همراه خود اقدام به تهیه فرمایید.\n کیت ددی چک شامل : \n1 عدد گجت مناسب با مدل تلفن همراه شما (دقت شود پس از استفاده با کمک دستمال مرطوب موجود در کیت پاکسازی شده و داخل نایلون زیپ دار داخل کیت قرار داده شود.) \n 4 عدد سرنگ \n 4 عدد ظرف مخصوص جمع آوری نمونه \n 4 بسته هر یک شامل: 1 عدد چمبر (2 عدد چمبر اضافه در کیت موجود است)، 1 عدد دستمال مرطوب الکلی، یک جفت دستکش یکبار مصرف، 1 عدد نایلون زیپ دار.'}
                />
                <Collapse
                    title={'نصب و راه اندازی اپلیکیشن'}
                    body={'برنامه تست باروری ددی چک را از بخش دانلود های سایت \"https://etcco.ir\" دانلود و نصب نمایید. امکان دانلود و نصب مستقیم از اپ استور، گوگول پلی، بازار و اول مارکت نیز فراهم است. نصب این برنامه بصورت رایگان می باشد. \n\n قبل از شروع گوشی خود را آماده کنید: رمز عبور تلفن شما را محافظت می¬کند. تلفن خود را در حالت پرواز قرار دهید. گوشی خود را حداقل 50٪ شارژ کنید و اطمینان حاصل کنید که برای اجرای برنامه گجت  به اندازه کافی حافظه آزاد دارید (حداقل 500 مگابایت). از ابتدای فرآیند آزمایش اگر شما نیاز به انجام مراحل فوق داشته باشید گجت به شما هشدار می¬دهد. اما بهتر است از قبل مورد توجه قرار گیرد.'}
                />
                <Collapse
                    title={'شرایط و ظوابط'}
                    body={"•به گفته سازمان جهانی بهداشت (WHO)، مایع منی به عنوان مواد زیستی خطرناک به شمار می¬رود که می تواند هپاتیت و HIV را به طور بالقوه انتقال دهد. لطفا قبل از شروع به کار از دستکش موجود در کیت استفاده نموده و پس از انجام آزمایش کلیه وسایل از جمله ظرف نمونه گیری، سرنگ و چمبر در نایلون پلاستیکی و درب بسته دور انداخته شود. \n\n •	دستورالعمل های تمیز کردن، بسته بندی و انبار کردن تا استفاده بعدی و دفع اجزای کیت گجت که در تماس با اسپرم قرار می گیرند باید با توجه به راهنمای کاربری به دقت مورد توجه قرار گیرند. \n\n •	اجزای کیت گجت آزمایش خانگی برای استفاده توسط یک نفر در نظر گرفته شده است. محتوای کیت را با هر کسی از جمله اعضای خانواده به اشتراک نگذارید. \n\n •	کاندوم برای جمع آوری نمونه توصیه نمی شود، زیرا ممکن است به دلیل عوامل موجود در کاندوم نتایج آزمایش را تحت تاثیر قرار دهد. \n\n لطفا توجه داشته باشید که استفاده از دارو D-norgestrel (پروژسترون استروئید) ممکن است بر میزان تحرک اسپرم شما تاثیر گذار باشد. \n\n •	عدم پر کردن صحیح اسلاید بدون پیروی از دستورالعمل ها ممکن است بر نتایج آزمون تاثیر بگذارد. \n\n •	 آزمون اسپرم خانگی گجت نباید برای مقاصد پیشگیری از بارداری استفاده شود. \n\n انجام تست گجت در محدوده دمای محیط 5/15 الی 5/29 درجه سانتی گراد مطلوب است. از گرمای شدید و گرمای مستقیم در طول آزمایش اجتناب کنید. نباید نمونه منی را گرم یا سرد کنید. \n\n •	از این آزمایش در ارزیابی اثربخشی جراحی وازکتومی استفاده نشود. \n\n •	عدم پیروی از دستورالعمل های پاکسازی وضدعفونی کردن می تواند منجر به انتقال بیماری های عفونی مانند هپاتیت یا HIV به دیگران شود. \n\n•	برای نتایج مطلوب، هیچ مقاربت جنسی بین 2 تا 7 روز قبل از آزمایش گجت نداشته باشید. \n\n •	پس از جمع آوری نمونه برای حصول بهترین نتایج، روند آزمایش گجت را دنبال کنید انتظار بیش از اندازه باعث مردن اسپرمها و عدم صحت نتایج خواهد بود. \n\n •	مقادیر اسپرم شما می تواند در طول زمان تغییر کند. یک نتیجه کم در آزمایش فعلی می تواند در یک ماه طبیعی باشد. مهم این است که دو بار تست خود را انجام دهید. به خاطر داشته باشید که تنها یک اسپرم برای تخمک گذاری نیز کافی است. \n\n •	این سیتم برای بررسی نمونه های ویروسی و میکروبی طراحی نشده است و استفاده از آن با این هدف توصیه نمی شود و موجب به خطر افتادن سلامتی می شود."}
                />
            </div>
        </div>
    );
};
export default AboutUs;