export default {
    // conditions screen
    app_name: "daddy Check",
    term_title: "شرایط و ضوابط",
    acceptsAndContinue: "ادامه",
    term: "آزمایش daddy Check  یک آزمایش شخصی  مبتنی بر گوشی هوشمند است که نه تنها تجزیه و تحلیل حرکتی و تعداد اسپرم را گزارش می دهد بلکه یک ویدیو زنده از اسپرم شما بهمراه تحلیل حرکتی و شمارشی را نشان می دهد. در مقاربت طبیعی، تنها یک اسپرم متحرک می تواند به تخمک منتقل شود،بنابراین مهم است که \"توانمندی\" اسپرم در حال حرکت را آزمایش کنید. کار با daddy Check آسان است. به سادگی مراحل تست را دنبال کنید، هر مرحله را بررسی کنید می توانید انیمیشن های آموزشی را بصورت کامل در سایت و اپلیکیشن مشاهده کنید. این تست با همراهی شما با فرآیند آماده سازی نمونه و بارگیری اسلاید در گجت daddy Check انجام می شود. پس از آن گجت daddy Check را روی گوشی خود قرار دهید و اسلاید را وارد کنید. daddy Check  یک ویدیو از اسپرم را ضبط و سپس آن را تجزیه و تحلیل می کند تا بررسی شود که شما دارای چه میزان اسپرم حرکتی و با چه مسیر حرکتی هستید. قبل از شروع، می توانید ببینید که روند کار چگونه است یا دستورالعمل های ارائه شده را بخوانید.\nلطفاً توجه داشته باشید روبیت یک آزمون اسپرم خانگی مبتنی بر گوشی هوشمند است که یک ارزیابی کمی و کیفی از تعداد اسپرمها و تحرک آنها بر اساس استاندارد WHO در اسپرم انسان را فراهم می کند.\nتوجه داشته باشید این آزمایش  یک جنبه معاینه اسپرم مردانه است و  آزمایش خانگی با گجت روبیت، ارزیابی جامع از وضعیت باروری مردان را ارائه نمیدهد. برای ارزیابی حرفه ای باید به مراکز تخصصی آزمایشگاهی مجاز ناباروری، مراکز درمان ناباروری با هدایت یک پزشک متخصص اورولوژی و یا متخصص زنان مراجعه کرد که مراکز استاندارد در بخش معرفی اپلیکیشن بر اساس نزدیکی به محل زندگی شما ارائه می شود و قابل جستجو می باشند.\nطبق نظر اکثر مراجع عظام تقلید مانند آیت الله خامنه ای (پرسش 788 و 129 اجوبه الاستفتائات)، آیت الله سیستانی و ... نمونه گیری از منی و اسپرم حتما بایستی به صورت غیر مستقیم و توسط همسر شرعی آن مرد صورت بپذیرد. یکی از اهداف مهم طراحی و استفاده از این پکیج شخصی سازی کردن این آزمایش در مراحل اول تشخیصی می باشد. اینجانب با قبول تمام شرایط فوق اذعان میکنم متاهل هستم و از همسر شرعی خود برای نمونه گیری کمک میگیرم. \nهشدار: سرویس دهنده و تولید کننده هیچ مسئولیت قانونی و شرعی در قبال استفاده نادرست و غیر شرعی برعهده نخواهد گرفت و در صورت استفاده غیر شرعی از آن موجب ضمان خواهد بود.\n",
    term_head: "به daddy Check خوش آمدید",
    accept: "شرایط daddy Check  را میپذیرم",
    notAcceptAlert: "لطفا ابتدا شرایط ذکر شده را مطالعه کرده و تایید نمایید",

    // login and signup and profile
    letStart: "بزن بریم !",
    login: "ورود",
    signup: "ثبت نام",
    anonymous_sign_to_app: "ورود میهمان",
    anonymous_alert: "شما بعنوان کاربر ناشناس به اپلیکیشن وارد خواهید شد . هیچ اطلاعاتی از سوابق شما روی فضای ابری برای بازیابی دوباره ، ذخیره نخوا هد شد. توجه داشته باشد در صورتی که نیاز به بازیابی نتایج دارید بصورت کاربر عادی در سیستم ثبت نام کنید .",
    username: "نام کاربری",
    password: "رمز عبور",
    forgot_password: "رمز عبور را فراموش کرده اید ؟",
    not_signup: "ثبت نام نکرده اید ؟",
    email: "ایمیل",
    share: "اشتراک گذاری",
    confirm_password: "تایید رمز",
    introduce: "کد معرفی : ",
    optional: "اختیاری",
    national_code: "کدملی",
    confirmation: "تایید",
    wallet: "کیف پول",
    languages: "زبان ها",
    empty_account_txt: "شما ناشناس هستید",
    empty_account_description: "با توجه به اینکه شما بعنوان کاربر ناشناس به اپلیکیشن وارد شده اید هیچ اطلاعاتی از سوابق شما روی فضای ابری برای بازیابی دوباره ، ذخیره نخواهد شد. در صورتی که نیاز به بازیابی نتایج دارید بصورت کاربر عادی با نام مستعار وارد شوید تا از محرمانگی و حریم شخصی برخوردار شوید.",
    anonymous_user: "کاربر ناشناس",

    // update 
    update: "بروز رسانی",
    details: "جزئیات",

    //languages
    change_languages: "تغییر زبان",
    change: "تغییر",
    select_languages: "زبان مورد نظر خود را انتخاب کنید",
    unselected_language_alert: "لطفا یکی از زبان ها را انتخاب کنید",
    persian: "فارسی",
    kurdish: "کردی",
    turkish: "ترکی",
    english: "انگلیسی",
    spanish: "اسپانیایی",
    german: "آلمانی",
    arabic: "عربی",


    //home (tabBar)
    home: "صفحه اصلی",
    profile: "پروفایل",
    online_sperm_analyze: "آنالیز آنلاین اسپرم",
    centers_search: "متخصصین و مراکز درمانی",
    video_training: "آموزش تصویری",
    text_training: "آموزش متنی",
    history: "سابقه",
    training_of_medical_staff: "آموزش کادر آزمایشگاه",
    right_now: "همین حالا",
    order: "را سفارش دهید",

    //textTraining and videoTraining
    text_training: "آموزش متنی",
    video_training: "آموزش تصویری",
    analysis_training: "آموزش آنالیز",
    shopping_training: "آموزش خرید",
    training_payment: "آموزش پرداخت",

    //history
    historys: "سابقه ها",
    chart: "نمودار",
    search: "جستجو",
    historys_list: "لیست سابقه ها",
    history_details: "جزئیات سابقه",


    //centers_search
    categories: "دسته بندی ها",
    more_details: "جزئیات بیشتر",
    search_for_medical_centers: "جسجوی مراکز درمانی",
    clinic_score: "امتیاز کلینیک",
    phoneNumber: "شماره تماس",
    address: "آدرس:",
    hours_of_work: "ساعت کاری",
    description: "توضیحات",
    social_networks: "شبکه های اجتماعی",
    saturday: "شنبه",
    sunday: "یکشنبه",
    monday: "دوشنبه",
    tuesday: "سه شنبه",
    wednesday: "چهارشنبه",
    thursday: "پنج شنبه",
    friday: "جمعه",


    ////// analysisSteps \\\\\\

    // footer and header
    step: "گام",
    next: "ادامه",
    back: "برگشت",

    // step 1
    supplies: "تجهیزات زیر از بسته daddy check را مطابق شکل در دسترس داشته باشید:",
    supplies_1: "گجت گوشی موبایل",
    supplies_2: "یک عدد ظرف نمونه گیری",
    supplies_3: "یک عدد محفظه نمونه گیری (لام)",
    supplies_4: "یک عدد پیپت",
    supplies_done: "تجهیزات را فراهم کردم",
    help_modal_txt_step_1: "کلیه لوازم مصرفی جهت انجام آزمایش یکبار مصرف بوده تنها گجت قابلیت چندین بار استفاده را دارا می باشد. لوازم مصرف شده را پس از اتمام هر بار آزمایش طبق دستورالعمل گفته شده در پایان آزمایش بیرون انداخته و در حفظ و نگهداری گجت دقت نموده و مطابق توضیحات پس از هر بار استفاده بطور کامل تمیز نمایید.",
    close_modal_txt: "آیا اطمینان دارید که میخواهید از روند آزمایش خارج شوید؟ \n در نظر داشته باشید با خارج شدن از روند آزمایش تمامی روال های انجام شده بدون دخیره سازی خاتمه خواهد یافت و روالهای آزمایش باید از ابتدا شروع گردد. \n توجه داشته باشید در صورتی که لوازم مصرفی از حالت استریل خارج شده اند ، دیگر برای آزمایش مورد استفاده قرار نگیرند .",
    close: "بستن",
    step_alert: "لطفا این گام را تایید نمایید  سپس به گام بعدی بروید",
    resume_analysis: "ادامه روند آزمایش",
    close_analysis: "اتمام روند آزمایش",

    //step 2
    select_gadget: "انتخاب گجت",
    attach_gadget_description: "چنانچه از قبل گجتی را افزوده اید و هنوز وسایل مصرفی آن تمام نشده است می توانید از لیست زیر آنرا انتخاب نمائید. در غیر اینصورت اگر هنوز موفق به خرید  گجت نشده اید، می توانید از طریق گزینه خرید گجت اقدام به سفارش نمایید و با استفاده از گزینه اضافه کردن گجت، نسبت به اضافه کردن گجت اقدام نمائید.",
    empty_gadget: "هنوز گجتی اضافه نشده است. \nاگر خریداری نموده اید اضافه کنید و یا اقدام به خرید گجت نمائید.\n",
    empty_gadget_alert: "لطفا ابتدا نسبت به انتخای و اضافه کردن گجت اقدام نمایید",
    help_modal_txt_step_2: "در این مرحله ابتدا دکمه اضافه کردن گجت را انتخاب نموده سپس کد QR ثبت شده بر روی جعبه ددی چک را اسکن نمایید و بعد از ثبت گجت آن را انتخاب نموده و به مرحله بعد بروید. اگر قبلا گجت را ثبت نموده اید تنها کافیست آن را انتخاب نمایید و دیگر نیازی به ثبت مجدد همان گجت نمی باشد.",
    gadget_list: "لیست گجت های من",
    serial: "شماره سریال: ",
    expire_date: "تاریخ انقضا: ",
    remaining_count: "دفعات باقی مانده: ",
    buy_gadget: "خرید گجت",
    add_gadget: "اضافه کردن گجت",

    //step 3
    collect_sample_head: "جمع آوری منی",
    collect_sample_description: "نمونه منی خود را مطابق با روش نمونه گیری ذکر شده در بخش آموزش های متنی در ظرف نمونه مطابق شکل بالا جمع آوری کنید.\nتوجه کنید از هیچگونه ماده خارجی برای روانسازی در طی نمونه گیری استفاده نکنید. همچنین نمونه هایی که از داخل کاندوم برای آزمایش استفاده شوند به هیچ عنوان قابلیت گزارش علمی را نخواهند داشت.\nتوجه داشته باشید کل نمونه برای ارائه گزارش مناسب باید جمع آوری گردد و از دور ریخت آن پیشگیری کنید.\nبعد از جمع آوری نمونه، دست های خود را با آب و صابون بشویید.\n ",
    sample_full: "نمونه به صورت کامل و با شرایط ذکر شده در ظرف نمونه جمع آوری شد",
    help_modal_txt_step_3: "مطابق با توضیحات داده شده در بخش آموزش های متنی (دستورالعمل نمونه گیری)، نمونه گیری را در ظرف مخصوص موجود در کیت انجام داده و از سرد و گرم کردن آن جدا بپرهیزید. ",

    // step 4
    sample_prop_head: "ورود اطلاعات اولیه از روی نمونه",
    help_modal_txt_step_4: "بهتر است در این بخش اطلاعات خواسته شده مربوط به نمونه خود را تکمیل نمایید. این اطلاعات در پرونده آزمایش شما ثبت می شود. در بخش گرانروی شما بایستی میزان غلظت نمونه خود را از بین گزینه های پیشنهادی تعیین نمایید. در بخش رنگ نمونه می بایست رنگی را که به نمونه شما نزدیک تر است از بین گزینه ها انتخاب نمایید. در قسمت حجم نمونه با استفاده از سرنگ موجود در کیت آن را یکبار بطور کامل پر نمایید اگر کل حجم نمونه به اندازه سرنگ پر شده بود یعنی حجم نمونه شما 2 میلی لیتر می باشد در صورتیکه سرنگ بطور کامل پر نشده و نمونه ای در ظرف نمانده باشد یعنی حجم نمونه کمتر از 2 میلی لیتر بوده و اگر بعد از یکبار پر کردن کامل سرنگ هنوز نمونه داخل ظرف باقی مانده باشد به این معناست که حجم نمونه شما بیشتر از 2 میلی لیتر می باشد.",
    sample_prop_head_description: "در این بخش میتوانید عنوان دلخواهی به آنالیز خود برای بازیابی آتی راحتتر تخصیص دهید.\nگرانروی یا ویسکوزیتی به معنی روان بودن و میزان آبکی بودن مایع منی شماست از گزینه های موجود میتوانید یک مورد را که فکر میکنید درست باشد انتخاب کنید. در فیلم آموزشی که قبلا مشاهد کرده اید تعیین میزان گرانروی آموزش داده شده بود.\nرنگ نمونه نیز مطابق فیلم آموزشی می تواند انتخاب گردد.\nهمچنین برای انتخاب میزان حجم نمونه از مقیاس موجود در جعبه بصورتی که در فیلم آموزش داده شده است استفاده کنید.\n",
    title_analysis: "عنوان آنالیز",
    optional: "اختیاری",
    add: "افزودن",
    sample_color: "رنگ نمونه",
    yellow: "زرد",
    dark_yellow: "زرد تیره",
    milky: "دارای رگه های خونی",
    creamy: "کرمی",
    sample_volume: "حجم نمونه (ml)",
    granular: "گرانروی (ویسکوزیتی)",
    normal: "نرمال",
    about_thick: "نسبتا غلیظ",
    very_thick: "خیلی غلیظ",
    most_thick: "غلظت شدید",
    cancel: "لغو",

    // step 5
    sample_maintenance: "زمان لازم جهت آماده سازی نمونه",
    twenty_minutes_wait: "حال برای حصول بهتر نتیجه، باید ۲۰ دقیقه صبر کنیم تا مایع منی آماده برای آزمایش شود. نمونه را در جایی  امن قرار دهید و مطالب را با ما دنبال کنید.\nنمونه شما در دمای اتاق باید نگهداری شود. آن را گرم یا خنک نکنید. نمونه را در یخچال قرار ندهید.\nتوجه داشته باشید انتظار بیش از اندازه باعث کم تحرکی و مردن اسپرم ها و عدم صحت نتایج خواهد بود.\n",
    already_ready: "قبلا نمونه به مدت ۲۰ دقیقه نگهداری شده است.",
    after_twenty: "لطفا منتظر بمانید تا زمان این گام سپری شود",
    help_modal_txt_step_5: "در این مرحله بایستی 20 دقیقه صبر نمایید تا نمونه شما مایع و رقیق شود بعد از اتمام این مدت بدون وقفه به مرحله بعد رفته و روند آزمایش را طی نمایید. زیرا مایع منی دارای زمان طلایی برای بررسی بوده که اگر این زمان بیشتر شود باعث ایجاد مشکل در نتیجه آزمایش شما می شود.",

    //step 6
    connect_gadget: "اتصال گجت به گوشی",
    help_modal_txt_step_6: "تلفن همراه خود را مطابق تصویر و همانطور که در فیلم آموزشی مشاهده نمودید بر روی گجت قرار داده و روی سطح صاف بدون حرکت بگذارید. دقت شود تلفن همراه را در دست نگیرید زیرا تکان باعث ایجاد اختلال در نتیجه آزمایش شما می شود.",
    purchased_gadget_description: "گجت خریداری شده بایستی مطابق تلفن همراه شما باشد. توجه شود از گوشیهای دیگر استفاده نشود.\nگوشی را مطابق شکل در گجت وارد کنید و روی یک میز صاف و بدون حرکت قرار دهید از این پس تا پایان آنالیز گوشی نباید تکان بخورد.\nاگر گوشی تکان بخورد نتایج تحت تاثیر قرار خواهد گرفت.\n",
    gadget_check: "گوشی مطابق شکل در گجت قرار گرفته و روی یک میز صاف بدون حرکت است.",

    //step 7
    sampling: "برداشتن نمونه با سرنگ",
    prepare_slide_description: "مطابق فیلم آموزشی ، در این مرحله با کمک سرنگ نمونه را رقیق و یک دست نموده بگونه ای که لخته ای در آن دیده نشود . سرنگ را از نمونه چندین بار پر وخالی نمایید تا یک دست شوند سپس مقدار کمی از آن  را  بردارید.",
    sample_removed: "نمونه با سرنگ برداشته شد",
    sample_removed_2: "نمونه رقیق و یکدست است",
    help_modal_txt_step_7: "اگر نمونه شما کاملا همگن و یکنواخت نبود، سرنگ را درون ظرف نمونه کرده و چندین بار پر و خالی نمایید تا یکدست شود. سپس سرنگ را با مقدار کمی از نمونه پر نمایید.",

    //step 8
    fill_sample: "پر کردن محفظه چمبر با نمونه",
    prepare_step_8_sedcription: "مطابق فیلم آموزشی، یک قطره از نمونه را  با کمک سرنگ در جایی که روی لام مطابق شکل نشان داده شده است قرار دهید و منتظر باشید محفظه لوزی شکل پر شود. اگر احساس کردید نمونه کم بوده اندکی از نمونه را دوباره در همان قسمت قرار دهید.\nحال که محفظه پر شده است با دستمال کاغذی اطراف لام را تمیز کنید و توجه کنید نمونه خارج از محفظه باقی نمانده باشد.\n",
    container_check_1: "محفظه نمونه پر شده است",
    container_check_2: "با دستمال کاغذی اطراف لام را تمیز کردم",
    help_modal_txt_step_8: " سرنگ را بر روی محل علامت گذاری شده چمبر قرار داده و خیلی آرام کمی سرنگ را بفشارید و منتظر باشید تا محفظه لوزی شکل چمبر بطور کامل با نمونه پر شود اگر هنوز محفظه کامل پر نشده مجددا این کار را تکرار نمایید تا زمانیکه از پر شدن کامل آن اطمینان حاصل نمایید و بعد با کمک دستمال کاغذی روی چمبر را بطور کامل تمیز کنید.  ",

    //step 9
    putting_up_container: "قرار دادن محفظه نمونه در گجت",
    prepare_step_9_sedcription: "لام آماده شده را به آرامی مطابق شکل و فیلم آموزشی در جایگاه آن در گجت وارد کرده و دقت کنید تا علامت مشخص F1 وارد گجت شود.\nتوضیح اینکه برای بالا رفتن دقت کار از سه بخش لام اندازه گیری صورت میگیرد. با آرامش در سه مرحله مطابق اعلام برنامه، لام باید در جایگاههای F2 ،F1 و F3 قرار گیرد.\n",
    btn_check_1: "لام آماده شده در جایگاه مخصوص روی گجت قرار داده شد.",
    btn_check_2: "لام آماده شده تا علامت مشخص F1 وارد گجت شد",
    help_modal_txt_step_9: "ابتدا محل های F1، F2 و F3 را بر روی چمبر مشاهده نمایید سپس چمبر را مطابق عکس و فیلم آموزشی تا محل F1 درون گجت قرار دهید.",

    //step 10
    send_first_field: "ارسال اطلاعات فیلد اول",
    send_done: "ارسال انجام شد",
    help_modal_txt_step_10: "در این مرحله می توانید حرکت اسپرم ها را مشاهده نمایید اگر تصویر دیده نشد از قرار دادن صحیح چمبر داخل گجت اطمینان حاصل کرده و دقت کنید تا جایگاه F1 چمبر داخل گجت باشد. اگر همچنان تصویری مشاهده نمی نمایید این امکان وجود دارد که محفظه لوزی چمبر پر نشده باشد که در اینصورت برای پر کردن محفظه مجددا تلاش نمایید و بعد لام را داخل گجت بگذارید بعد از رویت تصویر دکمه قرمز را فشار داده و منتظر پیام\" ارسال با موفقیت انجام شد\" بمانید. اگر ارسال انجام نشد مجددا تلاش نمایید.",
    send_step_10_sedcription: "اگر نمونه در لام و محفظه لوزی شکل بدرستی پر شده باشد و اگر لام بدرستی در محل F1 قرار دارد اکنون باید تصویر حرکتی اسپرمها را مشاهده بفرمائید در صورت تائید با زدن دکمه زیر نمونه گیری از این بخش انجام خواهد شد.",
    end_step_10_sedcription: "اطلاعات فیلد اول با موفقیت ارسال شد. در صورت عدم مشکل با فشردن دکمه ادامه به مرحله بعد بروید درغیر اینصورت دوباره این مرحله را تکرار کنید.",

    //step 11
    send_two_field: "ارسال اطلاعات فیلد دوم",
    help_modal_txt_step_11: "در این مرحله چمبر را تا جایگاه F2 بیرون کشیده و زمانیکه قادر به مشاهده اسپرم ها بودید دکمه قرمز را بفشارید و منتظر ارسال بمانید. دقت شود در کلیه مراحل گوشی و گجت همراه آن بایستی بی حرکت بر روی سطح صافی قرار گرفته باشد.",
    end_step_11_sedcription: "اطلاعات فیلد دوم با موفقیت ارسال شد. در صورت عدم مشکل با فشردن دکمه ادامه به مرحله بعد بروید درغیر اینصورت دوباره این مرحله را تکرار کنید.",

    //step 12
    send_three_field: "ارسال اطلاعات فیلد سوم",
    help_modal_txt_step_12: "این بار چمبر را تا محل F3 بیرون کشیده و بعد از مشاهده تصویر دکمه قرمز را بفشارید و منتظر ارسال بمانید. ",
    start_analysis: "شروع تحلیل",
    again: "دوباره",
    end_step_12_sedcription: "اطلاعات فیلد سوم با موفقیت ارسال شد. در صورت عدم مشکل با فشردن دکمه ادامه به مرحله بعد بروید درغیر اینصورت دوباره این مرحله را تکرار کنید.",


    //start analysis 
    successfully: "اطلاعات شما با موفقیت انجام شد.",
    system_processed: "سیستم درحال پردازش اطلاعات شماست این عمل ممکن است دقایقی طول بکشد.",

    //result analysis
    analyzing_information: "در حال تحلیل اطلاعات",
    end_analyzing: "پس از اتمام آزمایش و مشاهده نتیجه آن، ابتدا چمبر را از گجت جدا کرده و به همراه ظرف نمونه گیری، سرنگ و دستکش درون کیسه فریزری قرار داده و درب آن را محکم ببندید سپس به درون زباله بریزید. با کمک دستمال مرطوب موجود در کیت، گجت را بطور کامل تمیز کرده و بعد درون پلاستیک زیپ دار موجود در کیت نگهداری نمایید. کلیه این مراحل را با دقت انجام دهید زیرا نمونه و ابزار آلوده به آن میتواند موجب انتقال بیماری شود. \n\n جهت مشاهده جواب آزمایش خود دکمه برگشت به صفحه اصلی را انتخاب نموده واز بخش سابقه ها نتیجه آزمایش خود را مشاهده نمایید.",
    back_to_mainPage: "برگشت به صفحه اصلی",

};