export const slides = [
    {
        image: require('../../Assets/Images/step_1.jpg'),
        description: 'در گام اول بعد از حصول اطمینان از وجود تجهیزات مورد نیاز اشاره شده تیک مربوطه را انتخاب کرده و دکمه ادامه را بفشارید.',
    },
    {
        image: require('../../Assets/Images/step_2.jpg'),
        description: "در گام دوم در صورت عدم تهیه گجت از طریق درگاه فراهم شده نسبت به تهیه گجت اقدام نمایید. چنانچه از قبل گجت را خریداری نموده اید از طریق آیکون اضافه کردن گجت نسبت به ثبت آن در نرم افزار اقدام فرمایید. برای ثبت تنها کافی است تا کد QR موجود بر روی جعبه را اسکن نمایید.",
    },
    {
        image: require('../../Assets/Images/step_3.jpg'),
        description: "در گام سوم نمونه گیری طبق توضیحات گفته شده در بخش روش آماده سازی نمونه را انجام دهید و تیک مربوطه را انتخاب نمایید. ",
    },
    {
        image: require('../../Assets/Images/step_4.jpg'),
        description: "در گام چهارم در بخش عنوان آنالیز تاریخ روز انجام آزمایش را درج نمایید. بخش گرانروی (ویسکوزیتی)، غلظت نمونه خود را با توجه به آیتم های نمایش داده شده انتخاب نمایید. بخش رنگ نمونه، رنگ نمونه خود را با توجه به آیتم های نمایش داده شده انتخاب نمایید. بخش حجم نمونه، با توجه به توضیحات گفته شده در بخش روش آماده سازی نمونه، حجم اندازه گیری شده توسط سرنگ را در اینجا انتخاب نمایید. تکمیل نمودن این بخش جهت داشتن پرونده کاملی از نتیجه آزمایش به شما کمک می کند اگر تعیین ویژگی ها برای شما سخت است میتوانید به راحتی به مرحله بعد مراجعه نمایید.",
    },
    {
        image: require('../../Assets/Images/step_5.jpg'),
        description: "در گام پنجم 20 دقیقه زمان برای مایع و روان شدن کامل نمونه لازم است طبق زمان نمایش داده شده 20 دقیقه صبر نمایید. سپس بعد از اتمام زمان به مرحله بعد بروید دقت شود مراحل را با سرعت انجام دهید تا زمان طلایی از دست نرود تا نتیجه آزمایش دچار اختلال نشود.",
    },
    {
        image: require('../../Assets/Images/step_6.jpg'),
        description: "گام ششم در این مرحله مطابق تصویر نمایش داده شده گجت مربوط به گوشی خود را وصل نموده از تمیز بودن لنز دوربین خود اطمینان حاصل نمایید و از این مرحله به بعد طبق توضیحات مندرج، گوشی بایستی در سطح صاف و بدون حرکت قرار گیرد. ",
    },
    {
        image: require('../../Assets/Images/step_7.jpg'),
        description: "گام هفتم در این مرحله مطابق فیلم آموزشی و توضیحات در بخش روش آماده سازی نمونه، چندین بار نمونه را با کمک سرنگ پر و خالی نمایید تا کاملا همگن شود، سپس مقدار کمی از نمونه را با استفاده از سرنگ بردارید.",
    },
    {
        image: require('../../Assets/Images/step_8.jpg'),
        description: "گام هشتم، یک قطره از نمونه را در محل نشان داده شده روی چمبر قرار داده و چمبر را بصورت عمودی نگهدارید تا لوزی از نمونه کامل پر شود اگر بصورت کامل پر نشده بود بار دیگر قطره ای بریزید. سپس چمبر را با استفاده از دستمال کاغذی تمیز نمایید به گونه ای که نمونه خارج از محفظه چمبر باقی نمانده باشد.",
    },
    {
        image: require('../../Assets/Images/step_9.jpg'),
        description: "گام نهم، چمبر را مطابق شکل و فیلم آموزشی در محفظه خود بر روی گجت قرار داده به گونه ای که تا علامت F1 وارد گجت شود.",
    },
    {
        image: require('../../Assets/Images/step_10.jpg'),
        description: "گام دهم، در صورتیکه کلیه مراحل قبلی به درستی انجام شده باشد در این مرحله می توانید حرکت اسپرم ها را مشاهده نمایید سپس کلید قرمز رنگ را فشار داده و منتظر پیام \"ارسال انجام شد\" بمانید. در صورت بروز مشکل این مرحله را مجددا تکرار نمایید. ",
    },
    {
        image: require('../../Assets/Images/step_11.jpg'),
        description: "گام یازدهم، در این مرحله لام را تا محل F2 بیرون کشیده و در صورت مشاهده اسپرم ها کلید قرمز را بفشارید و همانند مرحله قبل منتظر پیام \"ارسال انجام شد\" بمانید در غیر اینصورت این مرحله را تکرار نمایید.",
    },
    {
        image: require('../../Assets/Images/step_12.jpg'),
        description: "گام دوازدهم، در این مرحله لام را تا محل F3 بیرون کشیده و در صورت مشاهده اسپرم ها کلید قرمز را بفشارید و همانند مرحله قبل منتظر پیام \"ارسال انجام شد\" بمانید در غیر اینصورت این مرحله را تکرار نمایید. در این مرحله پس از انجام ارسال کلید شروع تحلیل را انتخاب نمایید  و منتظر جواب آزمایش خود بمانید.",
    }
]